# Introduction to a Notebook

1. Navigating the browser-based IDE
1. Cells and Cell types

In [1]:
import pandas as pd

In [2]:
dataframe = pd.read_csv('./datasets/sample_grades.csv')

In [3]:
dataframe.shape

(40, 7)

## Exploring CSV data

`head()` method returns the first 5 rows

In [4]:
dataframe.head()

,Student ID,Gender,Project Phase 1,Project Phase 2,Mid-Semester Test,Final Exam,Grade
0,101,Male,18.25,15.5,94,61.0,PA
1,102,Female,17.75,30.0,79,62.0,PA
2,103,Male,0.00,0.0,78,15.0,NN
3,104,Male,20.00,25.0,69,65.0,PA
4,105,Male,18.75,30.0,96,51.0,PA

Define the number of rows you want to return, for example, 3

In [5]:
dataframe.head(3)

,Student ID,Gender,Project Phase 1,Project Phase 2,Mid-Semester Test,Final Exam,Grade
0,101,Male,18.25,15.5,94,61.0,PA
1,102,Female,17.75,30.0,79,62.0,PA
2,103,Male,0.00,0.0,78,15.0,NN

`tail()` prints the last 5 rows

In [6]:
dataframe.tail()

,Student ID,Gender,Project Phase 1,Project Phase 2,Mid-Semester Test,Final Exam,Grade
35,136,Male,18.50,22.0,26,68.0,PA
36,137,Female,20.00,26.0,89,63.0,PA
37,138,Male,18.75,30.0,59,52.0,PA
38,139,Male,19.00,30.0,70,NaN,PA
39,140,Male,20.00,29.0,84,77.0,PA

In [7]:
dataframe.tail(3)

,Student ID,Gender,Project Phase 1,Project Phase 2,Mid-Semester Test,Final Exam,Grade
37,138,Male,18.75,30.0,59,52.0,PA
38,139,Male,19.00,30.0,70,NaN,PA
39,140,Male,20.00,29.0,84,77.0,PA

Randomly select rows from the data with `sample()`

In [8]:
dataframe.sample(5)

,Student ID,Gender,Project Phase 1,Project Phase 2,Mid-Semester Test,Final Exam,Grade
15,116,Female,20.00,25.50,97,52.0,PA
13,114,Male,20.00,22.75,85,78.0,PA
28,129,Male,20.00,30.00,64,86.0,PA
10,111,Female,19.50,13.00,95,52.0,PA
22,123,Male,19.75,30.00,74,61.0,PA

In [9]:
dataframe.sample(5, random_state=82)

,Student ID,Gender,Project Phase 1,Project Phase 2,Mid-Semester Test,Final Exam,Grade
6,107,NaN,19.75,19.5,82,76.0,PA
24,125,NaN,20.00,29.5,70,62.0,PA
28,129,Male,20.00,30.0,64,86.0,PA
32,133,F,20.00,28.0,58,74.0,PA
21,122,Female,20.00,23.0,37,25.0,NN

In [10]:
dataframe.describe()

,Student ID,Project Phase 1,Project Phase 2,Mid-Semester Test,Final Exam
count,40.000000,40.000000,37.000000,40.000000,36.000000
mean,120.500000,16.987500,23.750000,72.100000,56.055556
std,11.690452,5.964626,7.509716,19.664885,20.520296
min,101.000000,0.000000,0.000000,26.000000,6.000000
25%,110.750000,17.687500,20.000000,59.750000,45.500000
50%,120.500000,19.500000,25.500000,76.000000,60.000000
75%,130.250000,20.000000,30.000000,86.000000,71.750000
max,140.000000,20.000000,35.000000,100.000000,91.000000

In [11]:
dataframe.count()

Student ID           40
Gender               37
Project Phase 1      40
Project Phase 2      37
Mid-Semester Test    40
Final Exam           36
Grade                40
dtype: int64

In [13]:
top_500_domains_df = pd.read_csv('./recon_workshop/01_jupyter_notebooks/datasets/top500Domains.csv')

In [14]:
top_500_domains_df.count()

Rank                    500
Root Domain             500
Linking Root Domains    500
Domain Authority        500
dtype: int64

In [15]:
domain_series = top_500_domains_df['Root Domain']

In [16]:
domain_series.head()

0       www.blogger.com
1           youtube.com
2        www.google.com
3          linkedin.com
4    support.google.com
Name: Root Domain, dtype: object

In [18]:
dataframe.isna().sum()

Student ID           0
Gender               3
Project Phase 1      0
Project Phase 2      3
Mid-Semester Test    0
Final Exam           4
Grade                0
dtype: int64